app/controllers/tasks_controller.rb

    def index

      @tasks = Card.find(params[:card_id]).tasks
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."card_id" = ?  [["card_id", 1]]

    def create
      @task = Task.new(task_params)

      respond_to do |format|
        if @task.save
---
INSERT INTO "tasks" ("name", "done", "card_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "A new task"], ["done", "f"], ["card_id", 1], ["created_at", "2015-08-21 21:41:10.953205"], ["updated_at", "2015-08-21 21:41:10.953205"]]

    def update
      respond_to do |format|
        if @task.update(task_params)
---
UPDATE "tasks" SET "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["done", "t"], ["updated_at", "2015-08-21 21:46:56.732674"], ["id", 17]]